from string import Template

#### RAG PROMPTS

#### System

system_prompt = Template("\n".join([
    "أنت مساعد ذكي لتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء إجابة اعتمادًا على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا في التعامل مع المستخدم.",
    "كن دقيقًا ومختصرًا في إجابتك، وتجنب المعلومات غير الضرورية.",
]))

#### Document

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer

footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المستندات المذكورة أعلاه، يرجى إنشاء إجابة للمستخدم.",
    "## الإجابة:",
]))